Revit 2027 API
OrdinateDimensionSetting.TextPosition Property
 Specifies the dimension text position.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public OrdinateTextPosition TextPosition { get; set; }
Public Property TextPosition As OrdinateTextPosition
	Get
	Set
public:
property OrdinateTextPosition TextPosition {
	OrdinateTextPosition get ();
	void set (OrdinateTextPosition value);
}
member TextPosition : OrdinateTextPosition with get, set
Property Value
OrdinateTextPosition
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
OrdinateDimensionSetting Class
Autodesk.Revit.DB Namespace